src/InformationRegisters/СтатистикаБуферДатаВнешниеЦКК/СтатистикаБуферДатаВнешниеЦКК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаБуферДатаВнешниеЦКК</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоJSON</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВнешнийЦКК</name>
    <type>
      <types>CatalogRef.ВнешниеЦКК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядковыйНомерПакета</name>
    <comment>Значение - ТекущаяУниверсальнаяДатаВМиллисекундах()</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыВнешнихЦКК/ТипыВнешнихЦКК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВнешнихЦКК</name>
  <enumValues>
    <name>Главные</name>
  </enumValues>
  <enumValues>
    <name>Подчиненные</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ТехнологическиеЖурналы/ТехнологическиеЖурналы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТехнологическиеЖурналы</name>
  <attributes>
    <name>КаталогНастройкиТЖ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогЛогов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Настройка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийСервер</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогЛоговСетевой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйТекстНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеЦКК</name>
    <attributes>
      <name>ПередаватьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийЦКК</name>
      <type>
        <types>CatalogRef.ВнешниеЦКК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШаблоныТЖ</name>
    <attributes>
      <name>ШаблонТЖВыбранный</name>
      <type>
        <types>CatalogRef.ТехнологическиеЖурналыШаблоны</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстШаблона</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ВнешниеЦКК/ВнешниеЦКК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеЦКК</name>
  <attributes>
    <name>WSСсылкаInputStatisticsDate</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВнешнегоЦКК</name>
    <type>
      <types>EnumRef.ТипыВнешнихЦКК</types>
    </type>
  </attributes>
  <attributes>
    <name>УИДПользователя</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортСчетчиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеЦКК</name>
    <attributes>
      <name>ПередаватьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийЦКК</name>
      <type>
        <types>CatalogRef.ВнешниеЦКК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/СтатистикаОтправкаДанныхВнешнимЦКК/Module.bsl
Функция ОтправитьДанные() Экспорт
    
    Общий.ПриНачалеВыполненияРегламентногоЗадания();
    
    ВнешниеЦКК = ПолучитьВнешниеЦККДляОтправки();
	
	МаксимальныйНомерПакета = Справочники.ПорядковыеНомераДанных.УстановитьСледующийНомер(Справочники.ПорядковыеНомераДанных.СтатистикаБуферДатаВнешниеЦКК.Ссылка);
	Для Каждого ВнешнийЦКК Из ВнешниеЦКК Цикл
		Параметры = Новый Массив;
		Параметры.Добавить(ВнешнийЦКК);
		Параметры.Добавить(МаксимальныйНомерПакета);
		ФоновыеЗадания.Выполнить("СтатистикаОтправкаДанныхВнешнимЦКК.ОтправитьДанныеВнешнемуЦКК", Параметры, Новый УникальныйИдентификатор(), "Статистика: Отправка данных внешнему ЦКК """ + ВнешнийЦКК["ВнешнийЦКК"] + """");
    КонецЦикла;
    
КонецФункции

Функция ПолучитьВнешниеЦККДляОтправки()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТехнологическиеЖурналыВнешниеЦКК.ВнешнийЦКК КАК ВнешнийЦКК,
	|	СправочникВнешниеЦКК.WSСсылкаInputStatisticsDate КАК WSСсылка,
	|	СправочникВнешниеЦКК.Пользователь КАК Пользователь,
	|	СправочникВнешниеЦКК.Пароль КАК Пароль
	|ИЗ
	|	Справочник.ТехнологическиеЖурналы.ВнешниеЦКК КАК ТехнологическиеЖурналыВнешниеЦКК
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ВнешниеЦКК КАК СправочникВнешниеЦКК
	|ПО
	|	ТехнологическиеЖурналыВнешниеЦКК.ВнешнийЦКК = СправочникВнешниеЦКК.Ссылка
	|	И ТехнологическиеЖурналыВнешниеЦКК.ПередаватьДанные = ИСТИНА
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧ_ВнешниеЦКК.ВнешнийЦКК КАК ВнешнийЦКК,
	|	ТЧ_ВнешниеЦКК.ВнешнийЦКК.WSСсылкаInputStatisticsDate КАК WSСсылка,
	|	ТЧ_ВнешниеЦКК.ВнешнийЦКК.Пользователь КАК Пользователь,
	|	ТЧ_ВнешниеЦКК.ВнешнийЦКК.Пароль КАК Пароль
	|ИЗ
	|	Справочник.ВнешниеЦКК КАК СправочникВнешниеЦКК
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ВнешниеЦКК.ВнешниеЦКК КАК ТЧ_ВнешниеЦКК
	|ПО
	|	ТЧ_ВнешниеЦКК.Ссылка = СправочникВнешниеЦКК.Ссылка
	|	И ТЧ_ВнешниеЦКК.ПередаватьДанные = ИСТИНА
	|ГДЕ
	|	СправочникВнешниеЦКК.ТипВнешнегоЦКК = &ТипВнешнегоЦККПодчиненный
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СправочникВнешниеЦКК.Ссылка КАК ВнешнийЦКК,
	|	СправочникВнешниеЦКК.WSСсылкаInputStatisticsDate КАК WSСсылка,
	|	СправочникВнешниеЦКК.Пользователь КАК Пользователь,
	|	СправочникВнешниеЦКК.Пароль КАК Пароль
	|ИЗ
	|	Справочник.ВнешниеЦКК КАК СправочникВнешниеЦКК
	|ГДЕ
	|	СправочникВнешниеЦКК.ТипВнешнегоЦКК = &ТипВнешнегоЦККГлавный
	|	И СправочникВнешниеЦКК.ЭкспортСчетчиков = ИСТИНА
	|";
	
	Запрос.УстановитьПараметр("ТипВнешнегоЦККПодчиненный", Перечисления.ТипыВнешнихЦКК.Подчиненные);
	Запрос.УстановитьПараметр("ТипВнешнегоЦККГлавный", Перечисления.ТипыВнешнихЦКК.Главные);
	Результат = Запрос.Выполнить();
	
	ВнешниеЦКК = Новый Массив;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВнешнийЦКК = Новый Соответствие;
		ВнешнийЦКК.Вставить("ВнешнийЦКК", Выборка.ВнешнийЦКК);
		ВнешнийЦКК.Вставить("WSСсылка", Выборка.WSСсылка);
		ВнешнийЦКК.Вставить("Пользователь", Выборка.Пользователь);
		ВнешнийЦКК.Вставить("Пароль", Выборка.Пароль);
		
		ВнешниеЦКК.Добавить(ВнешнийЦКК);
	КонецЦикла;
	
	Возврат ВнешниеЦКК;
КонецФункции


Функция ОтправитьДанныеВнешнемуЦКК(ВнешнийЦКК, МаксимальныйНомерПакета) Экспорт
	WSСсылка = ВнешнийЦКК["WSСсылка"];
	Пользователь = ВнешнийЦКК["Пользователь"];
	Пароль = ВнешнийЦКК["Пароль"];
	
	Определение = Неопределено;
		
	Попытка
		Определение = Новый WSОпределения(WSСсылка, Пользователь, Пароль,,180);
	Исключение
		Определение = Неопределено;
		Инфо = ИнформацияОбОшибке();
		Комментарий =
			"Описание = '" +Инфо.Описание + "', " +
			"ИмяМодуля = '" + Инфо.ИмяМодуля + "', " +
			"НомерСтроки = '" + Инфо.НомерСтроки + "', " +
			"ИсходнаяСтрока = '" + Инфо.ИсходнаяСтрока + "'.";
			
			ЗаписьЖурналаРегистрации(
				"Функция ОтправитьДанныеВнешнемуЦКК(...) Экспорт",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.СтатистикаОтправкаДанныхВнешнимЦКК,
				,
				Комментарий);
	КонецПопытки;
	
	Если Определение <> Неопределено Тогда
		Прокси = Новый WSПрокси(Определение, "http://1c.ru", "InputStatisticsDate", "InputStatisticsDateSoap",,180);
		Прокси.Пользователь = Пользователь;
		Прокси.Пароль = Пароль;
		
		ПорядковыеНомераПакетов = РегистрыСведений.СтатистикаБуферДатаВнешниеЦКК.ПолучитьТекущиеНомераПакетовДляОтправки(ВнешнийЦКК["ВнешнийЦКК"], МаксимальныйНомерПакета);
		
		ДанныеДляОтправки = Новый Соответствие;
		Для Каждого ПорядковыйНомерПакета Из ПорядковыеНомераПакетов Цикл
			Результат = ПолучитьДанныеИзСтатистикаБуферДатаВнешниеЦКК(ВнешнийЦКК["ВнешнийЦКК"], ПорядковыйНомерПакета);
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				ДанныеПериода = ДанныеДляОтправки[Выборка.ПериодМинута];
				Если ДанныеПериода = Неопределено Тогда
					ДанныеПериода = "";
				КонецЕсли;
				ДанныеПериода = Выборка.Данные + ";";
				ДанныеДляОтправки.Вставить(Выборка.ПериодМинута, ДанныеПериода);
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого ТекДанные Из ДанныеДляОтправки Цикл
			РезультатОтправки = Прокси.InputData(ТекДанные.Ключ, ТекДанные.Значение);
		КонецЦикла;
		
		РегистрыСведений.СтатистикаБуферДатаВнешниеЦКК.УдалитьДанныеПакета(ВнешнийЦКК["ВнешнийЦКК"], ПорядковыйНомерПакета);
	КонецЕсли;
КонецФункции

Функция ПолучитьДанныеИзСтатистикаБуферДатаВнешниеЦКК(ВнешнийЦКК, ПорядковыйНомерПакета)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СтатистикаБуферДатаВнешниеЦКК.ДатаЗаписи КАК Период,
	|	НАЧАЛОПЕРИОДА(СтатистикаБуферДатаВнешниеЦКК.ДатаЗаписи, МИНУТА) КАК ПериодМинута,
	|	СтатистикаБуферДатаВнешниеЦКК.ГУИД КАК ГУИД,
	|	СтатистикаБуферДатаВнешниеЦКК.Данные КАК Данные
	|ИЗ
	|	РегистрСведений.СтатистикаБуферДатаВнешниеЦКК КАК СтатистикаБуферДатаВнешниеЦКК
	|ГДЕ
	|	СтатистикаБуферДатаВнешниеЦКК.ВнешнийЦКК = &ВнешнийЦКК
	|	И СтатистикаБуферДатаВнешниеЦКК.ПорядковыйНомерПакета = &ПорядковыйНомерПакета
	|";

	Запрос.УстановитьПараметр("ВнешнийЦКК", ВнешнийЦКК);
	Запрос.УстановитьПараметр("ПорядковыйНомерПакета", ПорядковыйНомерПакета);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции
